{"pageProps":{"post":{"_published_at":"2018-12-12T00:00:00.000Z","title":"Why you should use create-react-app to Scaffold your Next React App?","published_at":"Dec 12, 2018","slug":"use-create-react-app-to-scaffold-next-react-app","authors":[{"id":"sasivarnan","name":"Sasivarnan R","bio":"Software Engineer. Tech Enthusiast. Loves coding 💻 and music 🎼.","location":"India","website":"https://geekscreed.com","twitter":"iamsasivarnan","linkedin":"sasivarnan","profile_image":"https://avatars0.githubusercontent.com/u/5305600?v=4","cover_image":""}],"content":"<p>Hello folks.</p>\n<p>In this article, I am gonna share why we should stop building custom webpack config and instead use <a href=\"https://facebook.github.io/create-react-app/\">create-react-app</a> to scaffold our react application.</p>\n<p>React is great. Out of the box, it is just a view library. The ecosystem around React is really great and it's huge.</p>\n<p>We have to basically pick the react compatible parts like router, state management library for building our application. This is a really tiring task.</p>\n<p>Setting up a modern react app from scratch is not easy and it makes us lost in the process due to a lot of overwhelming choices.</p>\n<p>React is evolving really fast. And so the tooling around it.</p>\n<p>If you are trying to set up everything from scratch, you need to hassle with lot more things like <code>webpack</code>, <code>babel</code> which is a different world altogether.</p>\n<blockquote>\n<p>The <code>create-react-app</code> helps in avoiding those hassles and enables us to focus on the application rather than the configuration.</p>\n</blockquote>\n<p>Even though <code>create-react-app</code> was available to developers since 2016, I have seen many people still searching for boilerplate and trying to set up the project from scratch even in 2018. This motivated me to write about this topic.</p>\n<p>Over the period of 2 years, the <a href=\"https://github.com/facebook/create-react-app/blob/master/CHANGELOG.md\">create-react-app</a> has matured a lot and provides a lot of cool features out of the box and drop in support for some features.</p>\n<p>Scaffolding a React project with <code>create-react-app</code> is super easy. No global installations of CLIs needed. If you use the recent versions on <code>node</code> and <code>npm</code>, then run</p>\n<div class=\"remark-highlight\"><pre class=\"language-bash\"><code> <span class=\"token function\">npm</span> init react-app <span class=\"token operator\">&lt;</span>app-name<span class=\"token operator\">&gt;</span>\n</code></pre></div>\n<p>If you are on the <code>yarn</code> team, then run</p>\n<div class=\"remark-highlight\"><pre class=\"language-bash\"><code> <span class=\"token function\">yarn</span> create react-app <span class=\"token operator\">&lt;</span>app-name<span class=\"token operator\">&gt;</span>\n</code></pre></div>\n<p>This will create a folder, with the project structure that is specified in <a href=\"https://facebook.github.io/create-react-app/docs/folder-structure\">documentation</a>. It has some built-in scripts to develop with ease using features like auto reload, linting, error messages and building minified production ready bundle.</p>\n<p>Before looking into the pros and cons of using <code>create-react-app</code>, let's see some of the features that are provided along with it, which can work without any configuration. I will give a small subset of features and the links for the docs.</p>\n<h3>Features</h3>\n<ul>\n<li>Support for most of latest JavaScript standards and JSX using pre-configured <a href=\"https://github.com/facebook/create-react-app/tree/master/packages/babel-preset-react-app\">babel</a> configuration.</li>\n<li>Drop-in support for <a href=\"https://prettier.io/\">prettier</a> which can be configured to run on staged files before git commit. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/setting-up-your-editor#formatting-code-automatically\">docs</a>.</li>\n<li>Out of the box support for <a href=\"https://github.com/css-modules/css-modules\">CSS Modules</a>. All you need to do is create the CSS file with extension <code>&#x3C;file-name>.module.css</code> and it will pick that file as a CSS Module. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/adding-a-css-modules-stylesheet\">docs</a>.</li>\n<li>Lot of the developers use <a href=\"https://sass-lang.com/\">SASS</a>. There is a drop in support for SASS as well. Just install <code>node-sass</code> to your project and you are good to go. All the files with <code>.sass</code> extension will be taken by the SASS preprocessor. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/adding-a-sass-stylesheet\">docs</a>.</li>\n<li>The CSS files in the bundle will be minified and vendor prefixed using <a href=\"https://github.com/postcss/autoprefixer\">autoprefixer</a>. Based on your target audience, you can enable polyfills for new CSS features using <code>browserslist</code> property in <code>package.json</code>. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/post-processing-css\">docs</a>.</li>\n<li>Support for code splitting via <a href=\"https://github.com/tc39/proposal-dynamic-import\">dynamic <code>import()</code></a>. This works great with <a href=\"https://reactjs.org/docs/code-splitting.html#reactlazy\"><code>React.lazy</code></a> and <code>Suspense</code>.</li>\n<li>Drop-in support for static type checkers like <a href=\"https://facebook.github.io/create-react-app/docs/adding-flow\">Flow</a> and <a href=\"https://facebook.github.io/create-react-app/docs/adding-typescript\">TypeScript</a>.</li>\n<li>Support for custom environment variables using <code>.env</code> files. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/adding-custom-environment-variables\">docs</a>.</li>\n<li>Opt-in support for PWAs. You will get <code>manifest.json</code> and Service Worker files out of the box. You just need to customize <code>manifest.json</code> according to your needs and enable service worker. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/making-a-progressive-web-app\">docs</a>.</li>\n<li>Provides support for testing using <a href=\"https://jestjs.io/\">Jest</a>. Learn more about it on the <a href=\"https://facebook.github.io/create-react-app/docs/running-tests\">docs</a>.</li>\n</ul>\n<p>As you see, <code>create-react-app</code> provides a lot of great features to build. In addition to that, there are a lot of advantages and some disadvantages of using <code>create-react-app</code> to scaffold your application.</p>\n<h3>Pros</h3>\n<ul>\n<li>You don't need to break yourself in configuration. You can just focus yourself on building the app.</li>\n<li>Saves a lot of time and energy as it provides a lot of common things out of the box.</li>\n<li>Training a newcomer about your project is easy. You just need to train them about the project and point them to the <code>create-react-app</code> <a href=\"https://facebook.github.io/create-react-app/\">documentation</a> for setup and configuration.</li>\n<li>As it is maintained by Facebook, support for new features of React will be available immediately.</li>\n<li>Updating to a new version is super easy. Just replace the version of <code>react-scripts</code> in <code>package.json</code> and run <code>npm install</code>. That's it.</li>\n<li>Speaking of updating, as <code>create-react-app</code> takes care of handling under the hood things, updating things like <code>webpack</code> and <code>babel</code> will be taken care by them. We don't need to hassle with it again.</li>\n</ul>\n<h3>Cons</h3>\n<ul>\n<li>It provides an opinionated option for building a react app. Not everyone will like that.</li>\n<li>It helps only if you are starting a project from scratch. It won't help on the case of your existing application where you need to partially migrate to react.</li>\n</ul>\n<p>The choices provided by create-react-app is not enough? You can easily opt-out by running</p>\n<div class=\"remark-highlight\"><pre class=\"language-bash\"><code>  <span class=\"token function\">npm</span> run <span class=\"token function\">eject</span>\n</code></pre></div>\n<p>This will copy all the configuration files like <code>webpack</code>, <code>eslint</code> into your project and gives you choice to customize it.</p>\n<p>As you see, using <code>create-react-app</code> provides you with a lot of advantages over building custom webpack config.</p>\n<p>Hope I have given an overview of the features of <code>create-react-app</code> and convinced you to choose it for your next React project.</p>\n<p>Starting a new React project? Which path are you gonna choose?</p>\n<p>With <code>create-react-app</code> or custom config from scratch?</p>\n<p>Are you using <code>create-react-app</code> on your existing app? Are you facing any issue with it?</p>\n<p>Feel free to share your opinion on comments.</p>\n","excerpt":"\nHello folks.\n\nIn this article, I am gonna share why we should stop building custom webpack config and instead use [create-react-app](https:","feature_image":"/images/blog/react-code-macbook.jpg","primary_tag":{"id":"react","name":"React JS","slug":"react","description":"Articles around React JS","feature_image":""},"tags":["react","web-dev","webpack"]},"tags":[{"id":"react","name":"React JS","slug":"react","description":"Articles around React JS","feature_image":""},{"id":"web-dev","name":"Web Development","slug":"web-dev","description":"Articles around Web Development","feature_image":""},{"id":"webpack","name":"Webpack","slug":"webpack","description":"Articles around Webpack","feature_image":""}]},"__N_SSG":true}